Tekla Open API Reference for Tekla Structures 2025
AnalysisPartPositionProperties.LongitudinalOffsetEnum Enumeration
 The longitudinal offsets.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LongitudinalOffsetEnum
Public Enumeration LongitudinalOffsetEnum
Members
Member name | Value | Description
LONGITUDINAL_OFFSET_NONE | 0 |  The longitudinal offset is "none".
LONGITUDINAL_OFFSET_EXTEND_ONLY | 1 |  The longitudinal offset is "extend only".
LONGITUDINAL_OFFSET_ALWAYS | 2 |  The longitudinal offset is "always".
See Also
Reference
Tekla.Structures.Analysis Namespace